Revit 2027 API
BaseImportOptions.Placement Property
 Where to place the import. Set this option to place the view at the origin or the center, or a shared coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImportPlacement Placement { get; set; }
Public Property Placement As ImportPlacement
	Get
	Set
public:
property ImportPlacement Placement {
	ImportPlacement get ();
	void set (ImportPlacement value);
}
member Placement : ImportPlacement with get, set
Property Value
ImportPlacement
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace